import pandas as pd
import os

# 데이터 읽기
df = pd.read_excel('data/grouped/grouped_산업체급식_재료량_기반_산출_함량_.xlsx')

# 메인메뉴 리스트
main_menus = [
    '가자미구이', '가자미조림', '가자미찜', '가자미튀김', '갈치구이', '갈치구이_기름', '갈치조림_무', '갈치튀김',
    '게맛살튀김', '게조림', '고기만두', '고등어구이', '고등어구이_기름', '고등어구이_카레', '고등어조림_무',
    '고등어조림_배추김치', '고등어찜', '고등어튀김', '고추잡채', '군만두', '굴비구이', '굴전', '김치 고기만두',
    '김치 돼지고기볶음', '김치만두', '김치볶음_김치_참치', '김치볶음_돼지고기', '김치볶음_참치', '김치볶음_햄',
    '김치찜_돼지고기', '김치찜_돼지고기_두부', '깐풍기', '꽁치구이', '꽁치조림_무', '꽁치조림_배추김치',
    '꽁치조림_채소', '꽁치튀김', '꽃게장_양념', '낙지무침', '낙지볶음', '낙지볶음_떡', '난자완스', '넙치구이',
    '달걀말이', '달걀말이_부추', '달걀말이_채소', '달걀부침(달걀후라이)', '달걀조림', '달걀찜', '달걀찜_당근',
    '달걀후라이', '닭강정', '닭고기 탕수', '닭구이', '닭날개구이', '닭다리구이', '닭다리조림', '닭볶음(닭갈비)',
    '닭볶음(닭갈비)_매운양념', '닭조림', '닭찜', '닭찜_간장', '닭찜_매운양념', '닭튀김', '닭튀김_양념', '대구찜',
    '돈가스', '동태전', '동태조림', '동태찜', '동태튀김', '돼지갈비구이', '돼지갈비찜', '돼지갈비찜_채소',
    '돼지고기 꼬치구이', '돼지고기 스테이크', '돼지고기 장조림', '돼지고기강정', '돼지고기볶음_김치',
    '돼지고기볶음_돼지고기_배추김치', '돼지고기볶음_돼지고기_오징어', '돼지고기볶음_돼지고기_채소',
    '돼지고기볶음_짜장', '돼지등심 장조림', '돼지불고기_간장', '돼지불고기_고추장', '돼지사태찜',
    '두부 달걀찜', '두부김치', '두부냉채', '두부볶음_돼지고기', '두부부침', '두부전', '두부조림', '두부튀김',
    '떡산적_소고기', '런천미트구이', '마파두부', '만두탕수', '맛살전', '망둥어찜', '매운 어묵볶음',
    '메추리알 돼지고기장조림', '메추리알 어묵조림', '메추리알장조림', '물만두', '미트볼조림', '바지락찜',
    '베이컨떡말이구이', '베이컨채소볶음', '병어조림', '북어강정', '북어구이', '북어채 고추장 무침',
    '삼겹살볶음_세발낙지', '삼색냉채', '삼치 양념구이', '삼치구이', '삼치조림', '삼치튀김', '새우 탕수',
    '새우무침', '새우전', '새우튀김', '생선까스', '세발낙지볶음', '소갈비 구이', '소갈비찜', '소고기 샌드위치',
    '소고기 완자전', '소고기 장조림', '소고기 장조림_꽈리고추', '소고기 장조림_메추리알', '소고기볶음',
    '소고기볶음_버섯', '소고기찜', '소고기채소볶음', '소등심 스테이크', '소등심구이', '소라무침', '소불고기',
    '소사태찜', '소시지 케첩볶음', '소시지볶음', '소시지볶음_채소', '소시지조림', '소시지조림_어묵',
    '소시지튀김', '순대', '스크램블드에그', '아귀찜', '양념 돼지고기튀김', '양장피', '어묵 감자볶음',
    '어묵볶음', '어묵볶음_어묵_채소', '어묵볶음_채소', '어묵잡채', '어묵조림', '어묵조림_풋고추', '어묵튀김',
    '연두부찜', '연어구이', '오리 간장불고기', '오리고기로스', '오징어무침', '오징어무침_채소', '오징어볶음',
    '오징어볶음_채소', '오징어불고기', '오징어조림', '오징어채무침', '오징어채무침_채소', '오징어채볶음',
    '오징어탕수', '오징어튀김', '완자전', '완자조림', '우럭구이', '임연수구이', '임연수조림', '임연수튀김',
    '장어 양념구이', '장조림_돼지고기_메추리알', '적어구이', '제육(돼지고기 수육)', '제육볶음', '제육볶음_오징어',
    '제육볶음_채소', '조기 양념구이', '조기 오븐구이', '조기구이', '조기찜', '조기튀김', '쥐포무침', '쥐포조림',
    '참치강정', '참치구이', '치킨데리야끼', '코다리조림', '코다리조림_간장', '코다리조림_무', '코다리찜',
    '콩조림', '탕수어', '탕수육', '팔보채', '피자', '함박스테이크', '해물 완자전', '해물볶음', '해물콩나물찜',
    '해물파전', '햄구이', '햄버거', '햄버거_돼지고기', '햄버거_치킨', '햄부침', '햄샌드위치', '햄샐러드',
    '햄채소볶음'
]

# 메인메뉴 데이터 추출
main_menu_df = df[df['식품명'].isin(main_menus)]

# 결과물을 저장할 디렉토리 생성
output_dir = 'main_menu_data'
if not os.path.exists(output_dir):
    os.makedirs(output_dir)

# 데이터 저장
output_filename = f"{output_dir}/main_menu.xlsx"
main_menu_df.to_excel(output_filename, index=False)

# 데이터 요약 출력
print(f"메인메뉴 데이터 파일이 생성되었습니다: {output_filename}")
print(f"총 {len(main_menu_df)}개의 메뉴가 추출되었습니다.")

# 조리방법별 메뉴 수 출력
print("\n조리방법별 메뉴 수:")
method_counts = main_menu_df['식품대분류명'].value_counts()
for method, count in method_counts.items():
    print(f"{method}: {count}개") 